[
  {
    "name": "INKTSY",
    "title": "THE ARTIST WITH A CAUSE",
    "description": "Born in the darkest alleys of the industrial district, she was raised amidst the clamor of forgotten machines and the whispers of a past rebellion. Her real name lost to time, she took on the moniker 'Inktsy', a name whispered in fear by the elite and chanted by the oppressed.",
    "icon": "https://i.ibb.co/89HBv4Q/Inksy.jpg",
    "art": "https://i.ibb.co/tXSbm0p/inktsy.png",
    "role": "Speedster",
    "difficulty": 4,
    "theme": "#ad45c2",
    "shapeMain": "#db77e7",
    "shapeBorder": "#feb4fe",
    "loreTitle": "Rebel with a Cause:",
    "lore": "Inktsy's origins are tied to the Sparkball arenas themselves. She grew up watching the sport from the shadows, mesmerized by the skill of the players but disillusioned by the corruption that controlled the game. The rich and powerful used Sparkball not just as entertainment but as a tool of oppression, keeping the masses distracted while they tightened their grip on Dunktown.  But Inktsy refused to be another pawn. She became a symbol of resistance, her identity hidden behind a mask that embodies the forgotten and the voiceless. With a spray can in one hand and a bat in the other, she started a movement, tagging the walls of Dunktown with symbols of rebellion and disrupting Sparkball matches to expose the corrupt underbelly of the sport.",
    "spotlightLink": "Fvk0a0wvUzk",
    "tips": "- Be Agile: Use Inktsy's speed to outmaneuver enemies and strike where they least expect it. Her agility makes her a formidable opponent in quick skirmishes.  - Strategic Tagging: Utilize Inktsy’s tagging ability not only to mark your path but also to disorient and confuse enemies. The symbols can be strategically placed to alter the battlefield.  - Combine Skills: Combine Inktsy's skills for maximum effectiveness. Her ability to tag enemies and disrupt Sparkball matches can create openings for devastating attacks.",
    "lmbIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "lmbTitle": "Ink Splatter",
    "lmbDescription": "Passive: Inktsy’s rapid strikes apply a 'Ink Splash' effect to enemies. After three hits, the enemy is marked, and Inktsy can unleash a powerful paint burst that slows and damages nearby foes. ",
    "rmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rmbTitle": "Shadow Strike",
    "rmbDescription": "Active: Inktsy performs a high-speed dash that leaves a trail of ink, confusing enemies and reducing their vision. If an enemy is hit by the dash, they are temporarily stunned and take additional damage from subsequent attacks.",
    "qIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "qTitle": "Rebel’s Mark",
    "qDescription": "Active: Inktsy marks an area with a rebellious symbol. Enemies within the marked area receive increased damage from Inktsy’s attacks and have their defenses lowered, making them easier targets for the team.",
    "spcIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "spcTitle": "Echo of the Rebellion",
    "spcDescription": "Ultimate: Inktsy unleashes a powerful wave of rebellious energy, causing a massive explosion of ink that deals damage and disrupts the enemy’s formations. Allies within the blast radius gain a temporary speed boost and reduced cooldowns on their abilities.",
    "rIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "rTitle": "Vanguard of the Revolution",
    "rDescription": "Ultimate: Inktsy channels the essence of the rebellion, creating an aura that damages and debuffs enemies while enhancing her allies’ combat capabilities. The aura also spreads Inktsy’s symbols, increasing the team's overall effectiveness in combat."
  },
  {
    "name": "Kana",
    "title": "FREERUNNING AGENT",
    "description": "Kana, a skilled freerunner and agent, is known for her agility and stealth. Raised in the gritty underbelly of a sprawling city, she honed her abilities in the shadows, using her speed and acrobatics to navigate the urban jungle and strike against injustice.",
    "icon": "https://i.ibb.co/2g9bhPJ/Kana.jpg",
    "art": "https://i.ibb.co/NNx0Cv6/enna.png",
    "role": "Speedster",
    "difficulty": 2,
    "theme": "#3c248c",
    "shapeMain": "#9d65ce",
    "shapeBorder": "#c18eee",
    "loreTitle": "Master of the Urban Maze:",
    "lore": "Kana's journey began as a street kid, learning to survive by dodging and weaving through the city's labyrinthine alleys. Her exceptional skills caught the eye of an underground resistance movement, where she quickly rose to prominence as a key operative.  Her unique blend of agility and stealth made her an invaluable asset in the fight against corruption and tyranny. Now, Kana uses her talents to expose and disrupt the machinations of those who seek to control the city from the shadows.",
    "spotlightLink": "vHwaQfTYJPY",
    "tips": "- Exploit Agility: Enna’s speed allows her to quickly evade and outmaneuver opponents. Use her agility to gain the upper hand in fast-paced encounters.  - Utilize Verticality: Take advantage of Enna's climbing and leaping abilities to access vantage points and surprise enemies from above.  - Timing is Key: Enna’s skills are most effective when used with precise timing. Plan your moves to maximize the impact of her abilities.",
    "lmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "lmbTitle": "Agile Assault",
    "lmbDescription": "Passive: Kana’s quick strikes increase her movement speed for a short duration, allowing her to reposition swiftly and strike again.",
    "rmbIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "rmbTitle": "Evasive Roll",
    "rmbDescription": "Active: Kana performs a rapid roll that grants her temporary invincibility and reduces damage taken. Enemies caught in the roll’s path are pushed back and disoriented.",
    "qIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "qTitle": "Vertical Slice",
    "qDescription": "Active: Kana leaps into the air and performs a high-speed descent, slashing at enemies below. Enemies hit by the descent are knocked down and take additional damage from subsequent attacks.",
    "spcIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "spcTitle": "Shadow Sprint",
    "spcDescription": "Ultimate: Kana dashes forward, leaving behind a trail of shadowy afterimages. Enemies crossing the trail are slowed and take damage over time. Allies within the trail gain increased movement speed and reduced cooldowns.",
    "rIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rTitle": "Phantom Strike",
    "rDescription": "Ultimate: Kana channels her energy into a series of high-speed strikes that cause massive damage to enemies in her path. Each strike briefly blinds and confuses opponents, giving her and her allies a strategic advantage."
  },
  {
    "name": "Janitor",
    "title": "CLEANER OF SECRETS",
    "description": "In the quiet hours of the night, when Dunktown sleeps, the Janitor emerges from the shadows. He isn’t here to clean the streets but to erase the stains left by those who think they’re untouchable. His real name is unknown, but the elites know him only as 'Janitor'—the one who cleans up their messes, permanently.",
    "icon": "https://i.ibb.co/XFVMpGJ/Janitor.jpg",
    "art": "https://i.ibb.co/NNx0Cv6/enna.png",
    "role": "Tank",
    "difficulty": 3,
    "theme": "#4a6988",
    "shapeMain": "#6f90ad",
    "shapeBorder": "#a3bed1",
    "loreTitle": "Silent Enforcer:",
    "lore": "Once a simple maintenance worker, Janitor discovered a secret that forever changed his fate. The city’s underbelly is dirtier than the streets he used to mop, and he decided it was time to take out the trash. Armed with an industrial-grade mop that doubles as a weapon and a toolkit that conceals deadly gadgets, Janitor started his one-man crusade against the corruption. No mess is too big, no secret too hidden. The Janitor ensures that justice is served, and he leaves no evidence behind.",
    "spotlightLink": "",
    "tips": "- Stay Resilient: Use Janitor’s high durability to soak up damage and protect your allies. His abilities allow him to withstand heavy assaults and keep the pressure on the enemy.  - Zone Control: Utilize Janitor’s area-denial abilities to control key points on the battlefield. His toolkit can disrupt enemy formations and create safe zones for your team.  - Punish Mistakes: Janitor’s skills are perfect for capitalizing on enemy errors. Lure them into traps or cut off their escape routes with well-placed abilities.",
    "lmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "lmbTitle": "Clean Sweep",
    "lmbDescription": "Passive: Every third basic attack from Janitor applies a 'Grime' debuff, slowing enemies and reducing their damage output. Enemies affected by 'Grime' take increased damage from Janitor’s abilities.",
    "rmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rmbTitle": "Mop Slam",
    "rmbDescription": "Active: Janitor slams his mop into the ground, creating a shockwave that stuns nearby enemies and knocks them back. Enemies hit by the center of the shockwave are also immobilized for a short duration.",
    "qIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "qTitle": "Chemical Spill",
    "qDescription": "Active: Janitor deploys a canister of toxic chemicals, creating a hazardous zone that damages and poisons enemies over time. Allies within the zone gain increased resistance to crowd control effects.",
    "spcIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "spcTitle": "Sweep the Floor",
    "spcDescription": "Ultimate: Janitor charges forward with his mop, sweeping all enemies in his path. Those caught are dragged along and take massive damage when Janitor slams them into a wall or obstacle.",
    "rIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rTitle": "Sterilization Protocol",
    "rDescription": "Ultimate: Janitor initiates a city-wide purge, releasing a wave of cleansing energy. All enemies within range are purged of buffs, and their movement speed is severely reduced. Allies gain increased health regeneration and reduced damage taken for a short period."
  },
  {
    "name": "Snooker",
    "title": "THE TACTICAL SHARPSHOOTER",
    "description": "In the underbelly of Dunktown, precision is a rare skill, and Snooker has mastered it. A former billiards prodigy turned street tactician, Snooker learned to play with more than just balls and cues. Now, his arena is the battlefield, where he lines up shots with cold calculation, taking down targets with the precision of a seasoned marksman. Every strike is part of a bigger plan, and every enemy is just another piece on the table.",
    "icon": "https://i.ibb.co/N79H3yt/Snooker.jpg",
    "art": "https://i.ibb.co/NNx0Cv6/enna.png",
    "role": "Marksman",
    "difficulty": 5,
    "theme": "#1f3b73",
    "shapeMain": "#3a5b9e",
    "shapeBorder": "#7186c1",
    "loreTitle": "Calculated Precision:",
    "lore": "Snooker grew up in the smoky backrooms of Dunktown’s gambling dens, where he perfected his skills as a billiards player. But the game wasn't just about hitting balls; it was about outsmarting opponents. When he realized that his talents could be used for something greater, Snooker left the tables behind and turned his focus to the streets. Armed with a modified cue that doubles as a high-powered rifle, he now plays a deadly game where every shot counts, and every miss is a lesson learned.",
    "spotlightLink": "",
    "tips": "- Aim Carefully: Snooker’s abilities rely on precision. Practice lining up shots to maximize damage and crowd control. His skills reward those who can hit targets consistently and accurately.  - Control the Battlefield: Use Snooker’s abilities to manipulate enemy movements and force them into disadvantageous positions. His crowd control and zoning abilities can disrupt enemy formations and create openings for your team.  - Play the Long Game: Snooker excels in drawn-out fights where he can plan his moves. Focus on staying safe while whittling down the enemy team’s health with well-placed shots.",
    "lmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "lmbTitle": "Bank Shot",
    "lmbDescription": "Passive: Snooker’s basic attacks ricochet off surfaces, allowing him to hit enemies hiding behind cover. The ricocheted shot deals additional damage if it strikes an enemy after bouncing.",
    "rmbIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "rmbTitle": "Line Up",
    "rmbDescription": "Active: Snooker charges up his cue, lining up a piercing shot that passes through multiple enemies. The longer the charge, the more damage it deals, and it applies a ‘Marked’ debuff to those hit, making them more vulnerable to Snooker’s attacks.",
    "qIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "qTitle": "Corner Pocket",
    "qDescription": "Active: Snooker sets up a trap on the battlefield that triggers after a delay, launching a burst of energy in a cone. Enemies caught in the burst are knocked back and stunned, giving Snooker time to reposition or land a critical shot.",
    "spcIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "spcTitle": "Break Shot",
    "spcDescription": "Ultimate: Snooker lines up a massive shot that shatters the battlefield, creating a shockwave that damages and disorients all enemies in its path. The blast also knocks them into the air, leaving them vulnerable to follow-up attacks from Snooker and his team.",
    "rIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rTitle": "Grand Finale",
    "rDescription": "Ultimate: Snooker sets up a trick shot, placing a series of targets around the battlefield. He then strikes the cue ball, bouncing it off the targets and dealing heavy damage to all enemies it hits. The final target triggers an explosion that stuns and blinds enemies caught in the blast."
  },
  {
    "name": "Gus",
    "title": "THE TINKERER",
    "description": "Gus was never one to follow the rules. Born in the scrapyards of Dunktown, he grew up piecing together machines from discarded parts. What started as a hobby quickly became an obsession. Now, Gus is known as the Tinkerer—a mechanical genius with a knack for creating contraptions that defy the laws of physics. With a toolbox full of gadgets and a mind full of ideas, Gus brings chaos to the battlefield, turning the tide of battle with his unpredictable inventions.",
    "icon": "https://i.ibb.co/2KQwz0B/Gus.jpg",
    "art": "https://i.ibb.co/tXSbm0p/inktsy.png",
    "role": "Support",
    "difficulty": 4,
    "theme": "#a5662e",
    "shapeMain": "#d48c52",
    "shapeBorder": "#e9b28a",
    "loreTitle": "Master of Gadgets:",
    "lore": "Gus’s early life was spent in the junkyards, where he scavenged for parts and built machines out of scraps. His inventions caught the attention of the wrong people, and soon he found himself forced to work for Dunktown's criminal syndicates. But Gus had other plans. He sabotaged their operations from within, using his gadgets to outsmart his captors and eventually break free. Now, Gus fights for himself, using his mechanical prowess to assist those who can’t defend themselves.",
    "spotlightLink": "",
    "tips": "- Adapt on the Fly: Gus’s gadgets offer a wide range of utility. Whether you need to heal, defend, or disrupt, Gus has a tool for the job. Keep an eye on your allies and adjust your strategy as the battle evolves.  - Strategic Deployment: Position Gus’s devices carefully. His turrets and traps can control key areas, forcing enemies to play on your terms. Combine them with your team's abilities for maximum impact.  - Disruptive Play: Gus excels at creating chaos. Use his gadgets to interrupt enemy plans, break formations, and turn the tide in your team’s favor.",
    "lmbIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "lmbTitle": "Scrap Shot",
    "lmbDescription": "Passive: Gus's basic attacks are powered by scrap materials he collects from the battlefield. Each hit builds up charge, which can be used to empower his gadgets, increasing their effectiveness and duration.",
    "rmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rmbTitle": "Junkyard Turret",
    "rmbDescription": "Active: Gus deploys a makeshift turret that automatically targets and fires at nearby enemies. The turret can be upgraded using scrap charges to increase its fire rate, range, or add special effects like slowing enemy movement.",
    "qIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "qTitle": "Gizmo Grenade",
    "qDescription": "Active: Gus lobs a grenade that releases a swarm of small drones on impact. The drones latch onto enemies, dealing damage over time and lowering their defenses. Allies can pick up dropped drones to gain temporary shields.",
    "spcIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "spcTitle": "Repurpose",
    "spcDescription": "Ultimate: Gus dismantles his current gadgets and repurposes the parts, instantly repairing them and granting a burst of energy that resets their cooldowns. The repaired gadgets gain a significant power boost for a short duration.",
    "rIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "rTitle": "Chaos Engine",
    "rDescription": "Ultimate: Gus activates his ultimate creation—a massive, multi-functional machine that changes its form based on the situation. It can switch between modes to either provide healing, lay down suppressive fire, or create a protective barrier around allies."
  },
  {
    "name": "Hamon",
    "title": "THE LIVING CURRENT",
    "description": "Hamon is a force of nature, a being born from the very energy that courses through Dunktown's power grid. A mysterious experiment gone wrong, Hamon is now a living embodiment of electricity, able to channel and manipulate currents with devastating precision. While Hamon struggles to control this immense power, those who underestimate him often find themselves at the mercy of a storm they cannot escape.",
    "icon": "https://i.ibb.co/pWBDWfK/Hamon.jpg",
    "art": "https://i.ibb.co/NNx0Cv6/enna.png",
    "role": "Mage",
    "difficulty": 5,
    "theme": "#2e8ca6",
    "shapeMain": "#5bb6d1",
    "shapeBorder": "#9cd5e6",
    "loreTitle": "Electric Awakening:",
    "lore": "Once a scientist working on experimental energy sources, Hamon was caught in a catastrophic accident that fused him with raw electricity. Now more energy than man, Hamon can no longer return to his old life. Instead, he roams the city’s underbelly, using his powers to seek out answers and protect those who have become targets of the corrupt. Though his control over his powers is far from perfect, Hamon channels his volatility into focused strikes that leave his enemies fried.",
    "spotlightLink": "",
    "tips": "- Master the Flow: Hamon’s abilities require careful timing and positioning. Use his skills to trap and electrocute enemies, making it difficult for them to escape. Stay mobile to avoid becoming an easy target.  - Chain Reactions: Hamon’s abilities work best in combination. Chain together his skills to maximize damage and control, creating powerful synergies that can wipe out entire teams.  - Manage Power: Hamon’s energy reserves are limited. Be mindful of his resource management, as running out of energy at the wrong time can leave you vulnerable.",
    "lmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "lmbTitle": "Static Charge",
    "lmbDescription": "Passive: Hamon’s attacks build up static electricity on enemies. After three strikes, the static discharges, stunning the target briefly and dealing bonus damage. Enemies struck by multiple discharges in quick succession become overcharged, taking increased damage.",
    "rmbIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "rmbTitle": "Volt Wave",
    "rmbDescription": "Active: Hamon sends out a wave of electrical energy in a straight line. Enemies hit by the wave are damaged and temporarily paralyzed, unable to use abilities or escape. The wave can bounce off surfaces, allowing for creative angles and surprise attacks.",
    "qIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "qTitle": "Conductive Field",
    "qDescription": "Active: Hamon generates a field of electricity at a target location. Enemies within the field have their speed reduced and take damage over time. Allies inside the field gain increased movement speed and reduced cooldowns on their abilities.",
    "spcIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "spcTitle": "Power Surge",
    "spcDescription": "Ultimate: Hamon taps into the full extent of his energy reserves, releasing a massive surge of electricity. The surge radiates outward, shocking all enemies in a large radius and overloading their systems, causing abilities to misfire and reducing their effectiveness.",
    "rIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rTitle": "Storm's Wrath",
    "rDescription": "Ultimate: Hamon becomes the eye of a deadly electrical storm. For a short time, bolts of lightning strike randomly around him, dealing massive damage to enemies caught in the storm. The lightning also charges Hamon’s abilities, reducing their cooldowns and increasing their power."
  },
  {
    "name": "Hotpaws",
    "title": "THE FLAMEWALKER",
    "description": "Hotpaws is no ordinary creature. Once a stray cat surviving in the back alleys of Dunktown, a freak accident in a lab gave him the ability to control fire. Now, with paws that leave scorched trails and a temper to match, Hotpaws prowls the city, seeking justice for the downtrodden. Though he’s small, his flames burn hotter than the sun, and those who cross him quickly learn that his bite is just as fierce as his bark.",
    "icon": "https://i.ibb.co/XSrBpGv/Hotpaws.jpg",
    "art": "https://i.ibb.co/tXSbm0p/inktsy.png",
    "role": "Assassin",
    "difficulty": 3,
    "theme": "#e35d2f",
    "shapeMain": "#f47c51",
    "shapeBorder": "#f9a489",
    "loreTitle": "From Stray to Flame:",
    "lore": "Hotpaws was once just another stray in Dunktown, scrapping for food and avoiding danger. His life took a turn when he stumbled into a secret laboratory and became the subject of a rogue experiment. The explosion that followed granted him control over fire, turning him from a scavenger into a force of nature. With his newfound powers, Hotpaws vowed to protect the forgotten and punish those who prey on the weak, igniting a fire of rebellion in the hearts of Dunktown’s underdogs.",
    "spotlightLink": "",
    "tips": "- Stay Mobile: Hotpaws excels at hit-and-run tactics. Use his speed and agility to dart in and out of combat, leaving enemies burning in your wake.  - Burn and Retreat: Don’t overcommit. Hotpaws’s abilities work best when you strike quickly and retreat before the enemy can retaliate. Keep the pressure on without putting yourself at risk.  - Exploit Weaknesses: Target vulnerable enemies and use Hotpaws’s burst damage to eliminate them before they can react.",
    "lmbIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "lmbTitle": "Scorching Strike",
    "lmbDescription": "Passive: Hotpaws’s attacks ignite enemies, dealing damage over time. The more attacks he lands, the hotter the flames, causing the burn effect to stack and increase in intensity.",
    "rmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rmbTitle": "Blazing Dash",
    "rmbDescription": "Active: Hotpaws dashes forward in a burst of flames, damaging all enemies in his path. The dash leaves behind a trail of fire that lingers, burning any enemies that walk through it. If Hotpaws hits an enemy with the dash, the cooldown is reduced.",
    "qIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "qTitle": "Inferno Leap",
    "qDescription": "Active: Hotpaws leaps into the air and crashes down at a target location, creating a fiery explosion on impact. Enemies caught in the blast are knocked back and suffer severe burn damage. Allies near the explosion gain a temporary speed boost.",
    "spcIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "spcTitle": "Molten Frenzy",
    "spcDescription": "Ultimate: Hotpaws unleashes his inner fury, engulfing himself in flames and increasing his attack speed and movement speed for a short duration. During this time, all of his abilities deal increased damage, and his basic attacks cause explosions on impact.",
    "rIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "rTitle": "Wildfire",
    "rDescription": "Ultimate: Hotpaws creates a massive ring of fire around him, trapping enemies inside. The ring slowly closes in, forcing enemies toward the center where Hotpaws can pick them off one by one. The longer enemies stay in the ring, the more damage they take."
  },
  {
    "name": "Ink",
    "title": "THE SHADOW ARTIST",
    "description": "Ink was once a renowned street artist, known for his stunning murals that captured the soul of Dunktown. But when his art began exposing the city's darkest secrets, he became a target. A mysterious benefactor offered him refuge, and in return, Ink was transformed into something more than human—a living weapon able to blend into the shadows and strike with the precision of a master painter. Now, he uses his skills to take down the corrupt, one stroke at a time.",
    "icon": "https://i.ibb.co/NrDRtq4/Ink.jpg",
    "art": "https://i.ibb.co/NNx0Cv6/enna.png",
    "role": "Assassin",
    "difficulty": 4,
    "theme": "#333f48",
    "shapeMain": "#6c7b85",
    "shapeBorder": "#a4b0b7",
    "loreTitle": "Canvas of Shadows:",
    "lore": "Ink’s art was more than just paint on walls—it was a voice for the voiceless, a rallying cry against the powerful. But when his murals began to reveal truths the elite wanted hidden, they silenced him. Left for dead in an alley, Ink was saved by a shadowy figure who saw potential in his talent. Reborn with the power to manipulate ink and shadows, Ink became the city's avenger, his art now a weapon of justice.",
    "spotlightLink": "",
    "tips": "- Play from the Shadows: Ink excels at ambushing enemies and disappearing before they can react. Use his ability to meld into the darkness to stay one step ahead of your opponents.  - Paint the Battlefield: Utilize Ink’s abilities to control space. His skills allow him to mark territory, restrict enemy movement, and set traps that turn the environment into his ally.  - Timing is Key: Ink’s skills require precise timing. Wait for the perfect moment to strike, and use his stealth to reposition and finish off weakened foes.",
    "lmbIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "lmbTitle": "Shadow Strike",
    "lmbDescription": "Passive: Ink’s basic attacks leave an ink mark on enemies. After three strikes, the ink detonates, dealing burst damage and slowing the target. The explosion also creates a small smoke cloud that Ink can use for cover.",
    "rmbIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "rmbTitle": "Veil of Ink",
    "rmbDescription": "Active: Ink creates a veil of swirling ink around him, rendering him invisible and increasing his movement speed for a short duration. The veil can be used to set up ambushes or escape dangerous situations. Enemies caught in the initial cast are blinded temporarily.",
    "qIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "qTitle": "Mark of the Artist",
    "qDescription": "Active: Ink marks a target area with a large, intricate symbol. Enemies who step into the marked area are slowed and have their defenses lowered. If Ink strikes a marked enemy, the symbol erupts, dealing damage and disorienting nearby foes.",
    "spcIcon": "https://i.ibb.co/r7QDPxp/skill-2.jpg",
    "spcTitle": "Silent Masterpiece",
    "spcDescription": "Ultimate: Ink unleashes his magnum opus—a massive ink explosion that covers the battlefield in darkness. Enemies caught in the explosion take heavy damage, are slowed, and have their vision severely impaired. Allies within the blast gain enhanced vision and reduced cooldowns.",
    "rIcon": "https://i.ibb.co/j56hVsL/skill-1.png",
    "rTitle": "Final Stroke",
    "rDescription": "Ultimate: Ink channels all his power into a single, devastating strike. He becomes untargetable for a moment, then reappears behind the enemy with the lowest health, delivering a lethal blow. If the attack kills the target, Ink instantly refreshes his abilities and gains a temporary speed boost."
  }
]
